# -*- fill-column: 69; org-confirm-babel-evaluate: nil -*-
#+STARTUP: align entitiespretty hidestars inlineimages latexpreview noindent showall
#+OPTIONS: prop:nil title:t toc:t \n:nil ::t |:t ^:{} -:t *:t ':nil

#+TITLE: YANG Geo Location
#+AUTHOR: Christian Hopps
#+EMAIL: chopps@chopps.org
#+AFFILIATION: LabN Consulting, L.L.C.
#+RFC_NAME: draft-chopps-netmod-geo-location
#+RFC_VERSION: 00
#+RFC_XML_VERSION: 3

#+begin_abstract
This document defines a generic geographical location object YANG
grouping. The geographical location grouping is intended to be used
in YANG models for specifying a location on or in reference to the
Earth or any other astronomical object.
#+end_abstract

* Examples

Below is a fictitious module that uses the geo-location grouping.

# We assign the output of geo-location-module block to a variable get
# it to execute to create the file.

#+CAPTION: Example YANG module using geo location.
#+name: uses-geo-location
#+header: :file uses-geo-location.yang
#+begin_src yang :results output code silent :exports code
  module uses-geo-location {
    namespace "urn:ietf:uses-geo-location";
    prefix ugeo;
    import geo-location { prefix geo; }
    organization "Empty Org";
    contact "Example Author <eauthor@example.com>";
    description "Example use of geo-location";
    revision 2019-02-02 { reference "None"; }
    container locatable-items {
      description "container of locatable items";
      list locatable-item {
        key name;
        description "A of locatable item";
        leaf name {
          type string;
          description "name of locatable item";
        }
        uses geo:geo-location;
      }
    }
  }
#+end_src

Below is a the YANG tree for the fictitious module that uses the
geo-location grouping.

#+NAME: Example YANG tree diagram of geo location use.
#+begin_src bash  :var file=uses-geo-location :results output verbatim replace :wrap example :exports results
pyang --tree-print-groupings -f tree ${file}
# pyang --tree-print-groupings -f tree ${file} | sed -e '/^$/d;s/^/  /'
#+end_src

#+CAPTION:
#+RESULTS: Example YANG tree diagram of geo location use.
#+begin_example
module: uses-geo-location
  +--rw locatable-items
     +--rw locatable-item* [name]
        +--rw name            string
        +--rw geo-location
           +--rw reference-frame
           |  +--rw alternate-system?    string {alternate-systems}?
           |  +--rw astronomical-body?   string
           |  +--rw geodetic-system
           |     +--rw geodetic-datum?    string
           |     +--rw coord-accuracy?    decimal64
           |     +--rw height-accuracy?   decimal64
           +--rw (location)
           |  +--:(ellipsoid)
           |  |  +--rw latitude     degrees
           |  |  +--rw longitude    degrees
           |  |  +--rw height?      decimal64
           |  +--:(cartesian)
           |     +--rw x            decimal64
           |     +--rw y            decimal64
           |     +--rw z?           decimal64
           +--rw velocity
           |  +--rw heading?   degrees
           |  +--rw speed?     decimal64
           +--rw timestamp?         types:date-and-time
#+end_example

Below is some example YANG XML data for the fictitious module that
uses the geo-location grouping.

#+NAME: validate-xml-example
#+HEADER: :var vfile=xml-example :var module=uses-geo-location
#+begin_src bash :results output verbatim replace :wrap example :exports none
  mkdir -p .validate
  # if ! yang2dsdl -t config -d .validate -v ${vfile} $module 2>&1 >/dev/null; then echo FAIL; fi
  if ! yang2dsdl -t config -d .validate -v ${vfile} $module 2>&1 >/dev/null; then echo FAIL; fi
#+end_src

#+RESULTS: validate-xml-example
#+begin_example
test-xml-example.xml validates
No errors found.
#+end_example

#+CAPTION: Example XML data of geo location use.
#+NAME: xml-example
#+begin_src xml :file test-xml-example.xml :results output code silent :exports code
  <ns0:config xmlns:ns0="urn:ietf:params:xml:ns:netconf:base:1.0">
    <locatable-items xmlns="urn:ietf:uses-geo-location">
      <locatable-item>
        <name>Gaetana's</name>
        <geo-location>
          <latitude>40.73297</latitude>
          <longitude>-74.007696</longitude>
        </geo-location>
      </locatable-item>
      <locatable-item>
        <name>Pont des Arts</name>
        <geo-location>
          <timestamp>2012-03-31T16:00:00Z</timestamp>
          <latitude>48.8583424</latitude>
          <longitude>2.3375084</longitude>
          <height>35</height>
        </geo-location>
      </locatable-item>
      <locatable-item>
        <name>Saint Louis Cathedral</name>
        <geo-location>
          <timestamp>2013-10-12T15:00:00-06:00</timestamp>
          <latitude>29.9579735</latitude>
          <longitude>-90.0637281</longitude>
        </geo-location>
      </locatable-item>
      <locatable-item>
        <name>Apollo 11 Landing Site</name>
        <geo-location>
          <timestamp>1969-07-21T02:56:15Z</timestamp>
          <reference-frame>
            <astronomical-body>moon</astronomical-body>
            <geodetic-system>
              <geodetic-datum>me</geodetic-datum>
            </geodetic-system>
          </reference-frame>
          <latitude>0.67409</latitude>
          <longitude>23.47298</longitude>
        </geo-location>
      </locatable-item>
    </locatable-items>
  </ns0:config>
#+end_src

#+NAME: Sample XML Skeleton
#+begin_src bash  :var file=uses-geo-location :results output verbatim replace :wrap comment :exports none
pyang -f sample-xml-skeleton ${file}
#+end_src

#+RESULTS: Sample XML Skeleton
#+begin_comment
<?xml version='1.0' encoding='UTF-8'?>
<data xmlns="urn:ietf:params:xml:ns:netconf:base:1.0">
  <locatable-items xmlns="urn:ietf:uses-geo-location">
    <locatable-item>
      <name/>
      <geo-location>
        <reference-frame>
          <alternate-system/>
          <geodetic-system>
            <coord-accuracy/>
            <height-accuracy/>
          </geodetic-system>
        </reference-frame>
        <latitude/>
        <longitude/>
        <height/>
        <x/>
        <y/>
        <z/>
        <velocity>
          <heading/>
          <speed/>
        </velocity>
        <timestamp/>
      </geo-location>
    </locatable-item>
  </locatable-items>
</data>
#+end_comment

